In [1]:
import numpy as np
import pandas as pd
from sklearn.preprocessing import StandardScaler
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df=pd.read_csv("sample1.csv")
df

   AGE  SALARY
0   23   80000
1   21   62000
2   23   80000
3   23   62000
4   56   10000
5   15   14000
6   34  100000
7   21   34000
8   20   40000
9   56   10000

In [3]:
df.sample(5)

   AGE  SALARY
5   15   14000
7   21   34000
4   56   10000
8   20   40000
6   34  100000

In [4]:
p=df['AGE']
p

0    23
1    21
2    23
3    23
4    56
5    15
6    34
7    21
8    20
9    56
Name: AGE, dtype: int64

In [5]:
from sklearn.preprocessing import StandardScaler

sc= StandardScaler()
sc_data = sc.fit_transform(df)
scaled = pd.DataFrame(sc_data,columns=df.columns)
print(scaled)

        AGE    SALARY
0 -0.438889  1.002795
1 -0.580466  0.416746
2 -0.438889  1.002795
3 -0.438889  0.416746
4  1.897134 -1.276284
5 -1.005198 -1.146051
6  0.339785  1.653960
7 -0.580466 -0.494886
8 -0.651255 -0.299536
9  1.897134 -1.276284

In [6]:
sc.mean_

array([2.92e+01, 4.92e+04])

In [7]:
from sklearn.preprocessing import MinMaxScaler

sl = MinMaxScaler()
sca_data = sl.fit_transform(df)
scal= pd.DataFrame(sca_data,columns=df.columns)
scal.head()

        AGE    SALARY
0  0.195122  0.777778
1  0.146341  0.577778
2  0.195122  0.777778
3  0.195122  0.577778
4  1.000000  0.000000

In [8]:
scaledd=pd.DataFrame(df)

In [9]:
np.round(df.describe(),1)

        AGE    SALARY
count  10.0      10.0
mean   29.2   49200.0
std    14.9   32375.6
min    15.0   10000.0
25%    21.0   19000.0
50%    23.0   51000.0
75%    31.2   75500.0
max    56.0  100000.0

In [10]:
fig (ax1,ax2) =plt.subplots(ncols=2,figsize=(12,5))
ax1.scatter(df['AGE'],df['SALARY'])
ax1.set_title("Before scaling")
ax2.scatter(df['AGE'],df['SALARY'])
ax2.set_title("After Scaling")
plt.show()

SyntaxError: cannot assign to function call here. Maybe you meant '==' instead of '='? (3962803227.py, line 1)

#### feature scaling is the technique to standardize the independent features present in the data in a fixed range
#### feature scaling having two types Standardization and normalization 
#### In normalization there are three techniqes --Standard scaler --Minmax Scaler --Robust
### Standardization also called z score